{"status":"success","movies":[{"id":1,"name":"Baaghi 3","release_date":"6 March 2020","rating":"2.5","review":"“Baaghi 3” Okay we know that Baaghi started as a rebel with a cause..Now it doesn’t matter whatever the cause as Tiger and the audience goes through the same rigmarole in each movie. Tiger is the young strong brother of Ritesh Deshmukh.","category":"Action","language":"Hindi","industry":"bollywood","banner":"Fox star studio","producer":"Sajid Nadiadwala","director":"Ahmed khan","cast":"Tiger shrof, Ritesh deshmukh, shradha kappor","poster":"assets/img/poster/baaghi3.png","description":"Ranveer \"Ronnie\" Chaturvedi lives with his elder brother Vikram. Protective toward him since child"},{"id":2,"name":"bala","release_date":"8 November 2019","rating":"4.4","review":"So,in simple words,Bala is a movie built on a wonderful concept that is very important to address, not only in India, but in the whole world.  The entire idea behind this \"baldness\", rather the \"imperfections of a human being\" concept has been utilized really well & portrayed so boldly and effectively that it actually ends up being a bit disturbing which is in fact what it is meant to be.","category":"Comedy","language":"hindi","industry":"bollywood","banner":"Maddock Films, Jio Studios","producer":"Dinesh Vijan","director":"Amar Kaushik","cast":"Ayushmann Khurrana, Bhumi Pednekar, Yami Gautam","poster":"assets/img/poster/bala.png","description":"The film opens in Kanpur in 2005, where 14-year-old students tease a bald teacher. Balmukund \"Bala\" Shukla, a popular kid who carries much pride for his hairstyle, leads the teasing of the teacher."},{"id":3,"name":"black panther","release_date":"29 January 2018","rating":"4.6","review":"This film is absolutely one of marvels best movies, but that does not mean that it is a child friendly film . This film has things ranging from violent stabbings to (at times) quite a sad story . There are many over the top fight scenes in this film with many stabbings but these are done without great detail , but still show realistic blood wounds . There is a lot of blood in this film but all of it is dried so nothing to shocking with the blood is shown . The fight scenes can also be very violent with lots of bashing in them and lots of dried blood shown and the baddie in one scene repeatedly kicks the hero even when he's given up , but this scene is very short and no blood is shown in this part .","category":"action/Sci-fi","language":"English","industry":"hollywood","banner":"Marvel Studios","producer":"Kevin Feige","director":"Ryan Coogler","cast":"Chadwick Boseman, Michael B. ,Jordan Lupita, Nyong'o Danai, Gurira Martin, Freeman Daniel, Kaluuya Letitia, Wright Winston, Duke Angela, Bassett Forest, Whitaker Andy, Serkis","poster":"assets/img/poster/blackpanther.png","description":"Thousands of years ago, five African tribes war over a meteorite containing the metal vibranium. One warrior ingests a \"heart-shaped herb\" affected by the metal and gains superhuman abilities, becoming the first \"Black Panther\". He unites all but the Jabari Tribe to form the nation of Wakanda. Over centuries, the Wakandans use the vibranium to develop advanced technology and isolate themselves from the world by posing as a Third World country. In 1992, Wakanda's King T'Chaka visit"},{"id":4,"name":"chhichhore","release_date":"6 September 2019","rating":"4.9","review":"Sushant Singh Rajput as Annirudh Pathak stands beside bed in hospital and says to his son.\"Beta yeh tumara result decide nhi karta ki tum loser ho ya nhi yeh tumari kosis karti h\".It is not only the dialogue which sounds inspiring.There are bunch of good dialogues in","category":"comedy","language":"hindi","industry":"bollywood","banner":"Nadiadwala Grandson Entertainment","producer":"Sajid Nadiadwala","director":"Nitesh Tiwari","cast":"Sushant Singh Rajput, Shraddha Kapoor, Varun Sharma, Tahir Raj Bhasin, Naveen Polishetty, Tushar Pandey, Prateik Babbar, Saharsh Kumar Shukla, Saanand Verma, Mohammad Samad","poster":"assets/img/poster/chhichore.png","description":"Aniruddh \"Anni\" Pathak (Sushant Singh Rajput) is a divorced middle-aged man living with his teenage son Raghav (Mohammad Samad), an aspiring engineer, who is awaiting the results of his entrance examination in the hope of enrolling in an Indian Institute of Technology (IIT). On the eve of the results, Anni gifts Raghav a bottle of champagne, promising him that they will celebrate his success together, unaware that Raghav is under intense pressure."},{"id":5,"name":"khuda haafiz","release_date":"14 August 2020","rating":"4.7","review":"Back to My Favorite Review Writing....This time it will be a memorable one as the movie i had seen over an OTT platform 😃😃..... Till now experience of movie was in a multiplex screen, relaxing on a couch over the top row and enjoying the show with a big box of popcorn","category":"Action, Drama","language":"hindi","industry":"bollywood","banner":"Panorama Studios","producer":"Kumar Mangat Pathak, Abhishek Pathak","director":"Faruk Kabir","cast":"Vidyut Jammwal, Shivaleeka Oberoi, Annu Kapoor, Shiv Panditt, Aahana Kumra","poster":"assets/img/poster/khudahafiz.png","description":"Detained by cops in a fictional Middle East country named Noman, Sameer Chaudhary (Vidyut Jammwal) agrees to reveal everything that led to his arrest, to I.K. Mishra (Ikhlaque Khan), an Indian embassy official. A flashback unfolds, where Sameer is a software engineer who marries a woman named Nargis (Shivaleeka Oberoi) in 2007. Their lives turn upside down when a financial crisis in 2008 leaves them both jobless."},{"id":6,"name":"panga","release_date":"24 January 2020","rating":"4.6","review":"Panga' is a film that honours the endless hours of work that mothers put behind their families and at the same time urges them to never give up on their dreams","category":"sports drama","language":"hindi","industry":"bollywood","banner":"Fox Star Studios","producer":"Fox Star Studios","director":"Ashwiny Iyer Tiwari","cast":"Kangana Ranaut, Jassi Gill, Richa Chadda, Neena Gupta","poster":"assets/img/poster/panga.png","description":"An old man with a stick walking try to wake up his neighbourhood, early in the morning. Jaya Nigam sleeps with her husband in a room in Bhanpur. She is having repeatedly abnormal movement during her sleep in which she kicks her husband, Prashant Sachdeva everynight. Her husband is a railway section engineeer. Later that morning, Jaya prepares breakfast for family and make her son, Aditya ready for school, before she goes to work."},{"id":7,"name":"Prati Roju Pandage","release_date":"20 December 2019","rating":"4.5","review":"Very nice movie and very excited I want to see the movie again It is a great movie. Emotions are mixed in perfectly with comedy and all of the scenes fit the story perfectly. The comedy isn't forced its situational and perfect. Sai Tej was great and did his role perfectly. Rao ...","category":"comedy","language":"Telugu","industry":"south indian","banner":"UV Creations, GA2 Pictures","producer":"Bunny Vasu","director":"Maruthi Dasari","cast":"Sai Dharam Tej, Rashi Khanna, Sathyaraj Rao, Ramesh","poster":"assets/img/poster/prati-roju.png","description":"Raghu Ramayya (Sathyaraj) Is over 75 years old. One day, Raghu Ramayya goes to the hospital and asks Dr. Bharath (Bharath Reddy) about his reports. Bharath tells him that he has a lung cancer. Raghu Ramayya informs his eldest son Anand Rao (Rao Ramesh) that he has cancer. Anand Rao asks Bharath how much time he has to live."},{"id":8,"name":"Sadugudu Vandi","release_date":"17 November 2018","rating":"4.5","review":"Taxiwaala (Sadugudu Vandi) works in parts, largely thanks to a wonderful performance from Vijay Deverakonda, but the film veers away from Vijay and his character in the second half, tying itself up in knots.","category":"Horror","language":"Tamil","industry":"south indian","banner":"GA2 Pictures, UV Creations","producer":"Sreenivas Kumar, Allu Aravind","director":"Rahul Sankrityan","cast":"Vijay Devarakonda, Priyanka Jawalkar","poster":"assets/img/poster/Sadugudu-Vandi.png","description":"After struggling to find a decent job, Shiva decides to become a taxi driver. However, things take a spooky turn after a series of mysterious deaths in the car."},{"id":9,"name":"The Avengers","release_date":"11 Apr 2012","rating":"4.8","review":"Just settle down with your 3D glasses for some bang-bang stuff where VFX speak louder than guns and the super guys have nothing to fall back on, other than their muscles, reflexes and super powers","category":"Action/ Sci-fi","language":"English","industry":"hollywood","banner":"Marvel Studios, Paramount Pictures, Walt Disney Studios Motion Pictures","producer":"Kevin Feige","director":"Joss Whedon","cast":"Chris Hemsworth, Scarlett Johansson, Robert Downey, Jr","poster":"assets/img/poster/avengers.jpg","description":"The Asgardian Loki encounters the Other, the leader of an extraterrestrial race known as the Chitauri. In exchange for retrieving the Tesseract,[N 2] a powerful energy source of unknown potential, the Other promises Loki an army with which he can subjugate Earth. Nick Fury, director of the espionage agency S.H.I.E.L.D., and his lieutenant Agent Maria Hill arrive at a remote research facility during an evacuation, where physicist Dr. Erik "},{"id":10,"name":"Avatar ","release_date":"10 Dec 2009","rating":"4.6","review":"Visually Spellbinding! We have here a science‑fiction epic set on an alien world. It's a classic story of a \"good‑guy\" hero who must overcome a battle within himself to do what is right. Although the movie doesn't exactly have the biggest twists, turns, or surprises, it simply","category":"Epic sci-fi","language":"english, hindi","industry":"hollywood","banner":"20th Century Fox","producer":"James Cameron, Jon Landau","director":"James Cameron","cast":"Sam Worthington, Zoe Saldana, Stephen Lang ,Michelle Rodriguez, Sigourney Weaver","poster":"assets/img/poster/avatar.jpg","description":"In 2154, humans have depleted Earth's natural resources, leading to a severe energy crisis. The Resources Development Administration (RDA) mines a valuable mineral unobtanium on Pandora, a densely forested habitable moon orbiting Polyphemus, a fictional gas giant in the Alpha Centauri star system.[11] Pandora, whose atmosphere is poisonous to humans, is inhabited by the Na'vi, a species of 10-foot tall (3.0 m), blue-skinned, sapient humanoids[37] that live in harmony with nature "}]}